app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "asdf"], ["body", "asdf"], ["created_at", 2019-12-18 10:10:49 UTC], ["updated_at", 2019-12-18 10:10:49 UTC], ["user_id", 1]]